HomeWork5/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork5/src/Documents/Продажи/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
EndProcedure

&AtClient
Procedure РасчитатьСумму(ТекДанные)
Если ТекДанные = неопределено Тогда
	Возврат;
КонецЕсли;
ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	РасчитатьСумму(Элементы.Товары.ТекущиеДанные);
EndProcedure
